package net.engining.pcx.cc.infrastructure.shared.enums;

import net.engining.pg.support.meta.EnumInfo;

@EnumInfo({
	"FFF|待入账",
	"FTD|成功入账，延时待冲销",
	"F00|成功入账",
	"F01|账户锁定-拒绝入账",
	"F02|卡片锁定-拒绝入账",
	"F03|入账逻辑模块不合法",
	"F04|交易代码不合法",
	"F05|交易日期不合法",
	"F06|账户已为呆账状态",
	"F08|交易借贷方向不匹配",
	"F09|交易金额不合法",
	"F10|未找到账户",
	"F11|未找到信用计划",
	"F13|找到多个信用计划",
	"F14|信用计划类型不存在",
	"F15|信用计划模板不存在",
	"F16|信用计划类型对应信用计划号不存在",
	"F18|年内费用过渡收取",
	"F25|卡片锁定",
	"F26|不允许分期交易",
	"F27|信用计划号不合法",
	"F37|信用计划不完整",
	"F41|介质卡号不存在",
	"F42|逻辑卡号不存在",
	"F43|对应主卡逻辑卡号不存在",
	"F44|交易币种非产品可入账币种",
	"F61|不许对分期交易提争议",
	"F92|因账户非活动而对交易warehouse",
	"F96|交易warehouse",
	"F97|入账引起子账户余额方向错误"
})
//只能定义3位，对应的数据库表字段长度为3
public enum PostingFlag {
	/**
	 * 待入账
	 */
	FFF,
	
	/**
	 * 成功入账，延时待冲销
	 */
	FTD,
	
	/**
	 * 成功入账
	 */
	F00,

	/**
	 * 账户锁定-拒绝入账
	 */
	F01,

	/**
	 * 卡片锁定-拒绝入账
	 */
	F02,

	/**
	 * 入账逻辑模块不合法
	 */
	F03,

	/**
	 * 交易代码不合法
	 */
	F04,

	/**
	 * 交易日期不合法
	 */
	F05,

	/**
	 * 账户已为呆账状态
	 */
	F06,

	/**
	 * 交易借贷方向不匹配
	 */
	F08,

	/**
	 * 交易金额不合法
	 */
	F09,

	/**
	 * 未找到账户
	 */
	F10,

	/**
	 * 未找到信用计划
	 */
	F11,

	/**
	 * 找到多个信用计划
	 */
	F13,
	
	/**
	 * 信用计划类型不存在
	 */
	F14,
	
	/**
	 * 信用计划模板不存在
	 */
	F15,

	/**
	 * 信用计划类型对应信用计划号不存在
	 */
	F16,
	
	/**
	 * 年内费用过渡收取
	 */
	F18,

	/**
	 * 卡片锁定
	 */
	F25,

	/**
	 * 不允许分期交易
	 */
	F26,

	/**
	 * 信用计划号不合法
	 */
	F27,

	/**
	 * 信用计划不完整
	 */
	F37,

	/**
	 * 介质卡号不存在
	 */
	F41,

	/**
	 * 逻辑卡号不存在
	 */
	F42,

	/**
	 * 对应主卡逻辑卡号不存在
	 */
	F43,
	
	/**
	 * 交易币种非产品可入账币种
	 */
	F44,

	/**
	 * 不许对分期交易提争议
	 */
	F61,

	/**
	 * 因账户非活动而对交易warehouse
	 */
	F92,

	/**
	 * 交易warehouse
	 */
	F96,
	
	/**
	 * 入账引起子账户余额方向错误
	 */
	F97
}
