package net.engining.pcx.cc.param.model.enums;

import net.engining.pg.support.meta.EnumInfo;

/**
 * 账户异常原因
 * @author zhengpy & heyu.wang
 *
 */
@EnumInfo({
	"E01|取现额度大于账户信用额度",
	"E02|分期额度大于账户信用额度",
	"E03|PLAN的余额不等于本PLAN各BNP余额之和",
	"E04|账户的余额不等于PLAN余额之和",
	"E05|分期转移-分期信息记录不存在",
	"E06|分期转移-找到多条分期信息记录",
	"E07|分期转移-转出信用计划不存在",
	"E08|分期转移-转入信用计划不存在",
	"E09|分期转移-转入信用计划建立失败",
	"E10|分期转移-找到多个转入信用计划",
	"E11|溢缴款还款-信用计划不存在",
	"E12|溢缴款还款-信用计划建立失败",
	"E13|溢缴款还款-找到多个信用计划",
	"E14|溢缴款还款-信用计划的计划类型PLAN_TYPE不存在",
	"E15|分期转移-信用计划的计划类型PLAN_TYPE不存在",
	"E16|账户已关闭"
})
public enum ExceptionType {
	/**
	 * 取现额度大于账户信用额度
	 */
	E01,
	/**
	 * 分期额度大于账户信用额度
	 */
	E02,
	/**
	 * PLAN的余额不等于本PLAN各BNP余额之和
	 */
	E03,
	/**
	 * 账户的余额不等于PLAN余额之和
	 */
	E04,
	/**
	 * 分期转移-分期信息记录不存在
	 */
	E05,
	/**
	 * 分期转移-找到多条分期信息记录
	 */
	E06,
	/**
	 * 分期转移-转出信用计划不存在
	 */
	E07,
	/**
	 * 分期转移-转入信用计划不存在
	 */
	E08,
	/**
	 * 分期转移-转入信用计划建立失败
	 */
	E09,
	/**
	 * 分期转移-找到多个转入信用计划
	 */
	E10,
	/**
	 * 溢缴款还款-信用计划不存在
	 */
	E11,
	/**
	 * 溢缴款还款-信用计划建立失败
	 */
	E12,
	/**
	 * 溢缴款还款-找到多个信用计划
	 */
	E13,
	/**
	 * 溢缴款还款-信用计划的计划类型PLAN_TYPE不存在
	 */
	E14,
	/**
	 * 分期转移-信用计划的计划类型PLAN_TYPE不存在
	 */
	E15,
	/**
	 * 账户已关闭
	 */
	E16
}